<script lang="ts">
import {ref} from 'vue'
export default {
    setup(props, ctx) {
        let body_weight = ref('');
        let body_height = ref('');

        return {
            body_weight, body_height
        }
    },
}
</script>
<template>
    <div class="content">
        <h1>Калькулятор для расчета индекса массы тела</h1>
        <div>
            <form @submit.prevent>
                <base-input 
                    labelText="Масса тела, кг"
                    inputType="number"
                    inputPlaceholder="Введите массу тела:"
                    v-model="body_weight"
                    class="mt-4  mb-4"
                />
                <base-input 
                    labelText="Рост, см"
                    inputType="number"
                    inputPlaceholder="Введите рост:"
                    v-model="body_height"
                    class="mt-4  mb-4"
                />
                <base-button>Рассчитать</base-button>
                <base-button>Сбросить</base-button>
            </form>
        </div>
        
            
        <div>
            <div>
                <h2>
                    Об калькуляторе
                </h2>
                <p>
                    *Этот калькулятор позволяет быстро и просто рассчитать индекс массы тела(ИМТ)
                </p>
            </div>
           <div>
                <h2>
                    Формула
                </h2>
                <p>
                    где: m — масса тела в килограммах; h — рост в метрах; измеряется в кг/м².
                    <br><br>
                    Калькулятор рачитывает показатели в следующих интервалах: рост не более 300 см; вес не менее 10 кг.
                    <br><br>
                    Возможен ввод дробных значений веса с точность до одного знака после запятой.
                </p>
           </div>
           <div>
                <h2>
                    Интерпретация
                </h2>
                <p>
                    В соответствии с рекомендациями ВОЗ разработана следующая интерпретация показателей ИМТ:
                </p>
           </div>
           <div>
                <h2>
                    Дополнительные сведения
                </h2>
                <p>
                    Целесообразно рассчитывать индекс массы тела для лиц старше 19 лет.
                    <br><br>
                    Индекс массы тела следует применять с осторожностью, исключительно для ориентировочной оценки — например, попытка оценить с его помощью телосложение профессиональных спортсменов может дать неверный результат (высокое значение индекса в этом случае объясняется развитой мускулатурой). Поэтому для более точной оценки степени накопления жира наряду с индексом массы тела целесообразно определять также индексы центрального ожирения.
                    <br><br>
                    Показатель индекса массы тела разработан бельгийским социологом и статистиком Адольфом Кетеле (Adolphe Quetelet) в 1869 году.
                </p>
           </div>
        </div>
    </div>
</template>
